---
kind: type
id: T:Autodesk.Revit.DB.Events.EventStatus
source: html/b2db4f59-a798-a61b-9dd4-02dd6e9700f0.htm
---
# Autodesk.Revit.DB.Events.EventStatus

Describes the status of an action which triggered a post event.

## Syntax (C#)
```csharp
public enum EventStatus
```